const addressData = {
    "สงขลา": {
        "เมืองสงขลา": ["บ่อยาง", "เขารูปช้าง", "เกาะแต้ว", "พะวง", "ทุ่งหวัง", "เกาะยอ"],
        "สทิงพระ": ["จะทิ้งพระ", "กระดังงา", "สนามชัย", "ดีหลวง", "ชุมพล", "คลองรี", "คูขุด", "ท่าหิน", "วัดจันทร์", "บ่อแดง", "บ่อดาน"],
        "จะนะ": ["บ้านนา", "ป่าชิง", "สะพานไม้แก่น", "สะกอม", "นาหว้า", "นาทับ", "น้ำขาว", "ขุนตัดหวาย", "ท่าหมอไทร", "จะโหนง", "คู", "แค", "ตลิ่งชัน"],
        "นาทวี": ["นาทวี", "ฉาง", "นาหมอศรี", "คลองทราย", "ปลักหนู", "ท่าประดู่", "สะท้อน", "ทับช้าง", "ประกอบ", "คลองกวาง"],
        "เทพา": ["เทพา", "ปากบาง", "ลำไพล", "ท่าม่วง", "วังใหญ่", "สะกอม", "เกาะสะบ้า"],
        "สะบ้าย้อย": ["สะบ้าย้อย", "ทุ่งพอ", "เปียน", "บ้านโหนด", "จะแหน", "คูหา", "เขาแดง", "บาโหย", "ธารคีรี"],
        "ระโนด": ["ระโนด", "คลองแดน", "ตะเครียะ", "ท่าบอน", "บ้านใหม่", "บ่อตรุ", "ปากแตระ", "พังยาง", "ระวะ", "วัดสน", "บ้านขาว", "แดนสงวน"],
        "กระแสสินธุ์": ["กระแสสินธุ์", "เกาะใหญ่", "เชิงแส", "โรง"],
        "รัตภูมิ": ["กำแพงเพชร", "ท่าชะมวง", "ควนรู", "เขาพระ", "คูหาใต้"],
        "สะเดา": ["สะเดา", "ปริก", "พังลา", "สำนักแต้ว", "ทุ่งหมอ", "ท่าโพธิ์", "ปาดังเบซาร์", "สำนักขาม", "เขามีเกียรติ"],
        "หาดใหญ่": ["หาดใหญ่", "ควนลัง", "คอหงส์", "คูเต่า", "ค่ายม่วง", "ทุ่งตำเสา", "ทุ่งใหญ่", "ท่าข้าม", "น้ำน้อย", "บ้านพรุ"],
        "นาหม่อม": ["นาหม่อม", "พิจิตร", "ทุ่งขมิ้น", "คลองหรัง"],
        "ควนเนียง": ["รัตภูมิ", "ควนโส", "ห้วยลึก", "บางเหรียง"],
        "บางกล่ำ": ["บางกล่ำ", "ท่าช้าง", "แม่ทอม", "บ้านหาร"],
        "สิงหนคร": ["สทิงหม้อ", "ทำนบ", "รำแดง", "ชิงโค", "หัวเขา", "บางเขียด", "ม่วงงาม", "วัดขนุน", "ป่าขาด", "ชะแล้"],
        "คลองหอยโข่ง": ["คลองหอยโข่ง", "ทุ่งลาน", "โคกม่วง", "คลองหลา"]
    },
    "สตูล": {
        "เมืองสตูล": ["พิมาน", "คลองขุด", "ควนขัน", "บ้านควน", "ฉลุง", "เกาะสาหร่าย", "ตันหยงโป", "เจ๊ะบิลัง", "ตำมะลัง", "ปูยู", "ควนโพธิ์", "เกรียงไกร"],
        "ควนโดน": ["ควนโดน", "ควนสตอ", "ย่านซื่อ", "วังประจัน"],
        "ควนกาหลง": ["ควนกาหลง", "ทุ่งนุ้ย", "อุไดเจริญ"],
        "ท่าแพ": ["ท่าแพ", "แป-ระ", "สาคร", "ท่าเรือ"],
        "ละงู": ["ละงู", "เขาขาว", "น้ำผุด", "แหลมสน", "ปากน้ำ", "กำแพง"],
        "ทุ่งหว้า": ["ทุ่งหว้า", "นาทอน", "ขอนคลาน", "ทุ่งบุหลัง", "ป่าแก่บ่อหิน"],
        "มะนัง": ["ปาล์มพัฒนา", "นิคมพัฒนา"]
    },
    "ปัตตานี": {
        "เมืองปัตตานี": ["สะบารัง", "อาเนาะรู", "จะบังติกอ", "บานา", "ตันหยงลุโละ", "คลองมานิง", "กะมิยอ", "บาราโหม", "ปะกาฮะรัง", "รูสะมิแล", "ตะลุโบะ", "บาราเฮาะ", "ปุยุด"],
        "โคกโพธิ์": ["โคกโพธิ์", "มะกรูด", "บางโกระ", "ป่าบอน", "ทรายขาว", "นาประดู่", "ปากล่อ", "ทุ่งพลา", "ท่าเรือ", "ช้างให้ตก", "ควนโนรี", "นาเกตุ"],
        "หนองจิก": ["ตุยง", "เขาตูม", "ท่ากำชำ", "บ่อทอง", "บางเขา", "บางตาวา", "ปุโละปุโย", "คอลอตันหยง", "ดอนรัก", "ดาโต๊ะ", "ลิปะสะโง", "ยาบี"],
        "ปะนาเระ": ["ปะนาเระ", "ท่าข้าม", "บ้านนอก", "ดอน", "ควน", "ท่าน้ำ", "คอกกระบือ", "พ่อมิ่ง", "บ้านกลาง", "น้ำบ่อ"],
        "มายอ": ["มายอ", "ถนน", "ตรัง", "กระหวะ", "ลุโบะยิไร", "ลางา", "กระโด", "เกาะจัน", "ปะโด", "สาคอบน", "สาคอใต้", "สระหม้าย", "สะกำ"],
        "ทุ่งยางแดง": ["ตะโละแมะนา", "พิเทน", "น้ำดำ", "ปากู"],
        "สายบุรี": ["ตะลุบัน", "ตะบิ้ง", "ปะเสยะวอ", "บางเก่า", "บือเระ", "เตราะบอน", "กะดุนง", "ละหาร", "มะนังดาลำ", "แป้น", "ทุ่งคล้า"],
        "ไม้แก่น": ["ไม้แก่น", "ไทรทอง", "ดอนทราย", "ตะโละไกรทอง"],
        "ยะหริ่ง": ["ยะหริ่ง", "บางปู", "แหลมโพธิ์", "ตะโละกาโปร์", "ปิยามุมัง", "ตาแกะ", "บาลอย", "ตอหลัง", "มะนังยง", "หนองแรต", "ราตาปันยัง", "สาบัน", "ตันหยงจึงงา", "ตันหยงดาลอ"],
        "ยะรัง": ["ยะรัง", "สะดาวา", "ประจัน", "สระนียอ", "กระโด", "กอลำ", "เมาะมาวี", "คลองใหม่", "ระแว้ง", "ปิตูมุดี", "เขาตูม"],
        "กะพ้อ": ["กะรุบี", "ตะโละดือรามัน", "ปล่องหอย"],
        "แม่ลาน": ["แม่ลาน", "ม่วงเตี้ย", "ป่าไร่"]
    },
    "ยะลา": {
        "เมืองยะลา": ["สะเตง", "บุดี", "เปาะเส้ง", "ลิมุต", "นิบงบารู", "ยุปา", "ลำใหม่", "หน้าถ้ำ", "ลำพะยา", "ตาเซะ", "สะเตงนอก", "ท่าสาป", "พร่อน"],
        "เบตง": ["เบตง", "ยะรม", "ตาเนาะแมเราะ", "อัยเยอร์เวง", "ธารน้ำทิพย์"],
        "บันนังสตา": ["บันนังสตา", "บาเจาะ", "ตาเนาะปูเต๊ะ", "ถ้ำทะลุ", "ตลิ่งชัน", "เขื่อนบางลาง"],
        "ธารโต": ["ธารโต", "บ้านแหร", "แม่หวาด", "คีรีเขต"],
        "ยะหา": ["ยะหา", "ละแอ", "ปะแต", "บาโร๊ะ", "ตาชี", "บาโงยซิแน", "กาตอง"],
        "รามัน": ["กายูบอเกาะ", "กาลูปัง", "กะรุบี", "เกะรอ", "จะกว๊ะ", "ท่าธง", "เนินงาม", "บาลอ", "บาโงย", "บือมัง", "ยะต๊ะ", "วังพญา", "อาซ่อง", "โกตาบารู", "ตะโล๊ะหะลอ", "ยาวอ"],
        "กาบัง": ["กาบัง", "บาละ"],
        "กรงปินัง": ["กรงปินัง", "สะเอะ", "ห้วยกระทิง", "ปุโรง"]
    },
    "นราธิวาส": {
        "เมืองนราธิวาส": ["บางนาค", "ลำภู", "มะนังตายอ", "กะลุวอ", "กะลุวอเหนือ", "โคกเคียน"],
        "ตากใบ": ["เจ๊ะเห", "ไพรวัน", "พร่อน", "ศาลาใหม่", "บางขุนทอง", "เกาะสะท้อน", "นานาค", "โฆษิต"],
        "บาเจาะ": ["บาเจาะ", "ลุโบะสาวอ", "กาเยาะมาตี", "ปะลุกาสาเมาะ", "บาเระเหนือ", "บาเระใต้"],
        "ยี่งอ": ["ยี่งอ", "จอเบาะ", "ลุโบะบือซา", "ลุโบะบายะ", "ตะปอเยาะ", "ละหาร"],
        "ระแงะ": ["ตันหยงมัส", "ตันหยงลิมอ", "บองอ", "กาลิซา", "บาโงสะโต", "เฉลิม", "มะรือโบตก"],
        "รือเสาะ": ["รือเสาะ", "รือเสาะออก", "สาวอ", "เรียง", "สามัคคี", "บาตง", "ลาโละ", "โคกสะตอ", "สุวารี"],
        "ศรีสาคร": ["ศรีสาคร", "เชิงคีรี", "ซากอ", "ตามะยู", "กาหลง", "ศรีบรรพต"],
        "แว้ง": ["แว้ง", "กายูคละ", "ฆอเลาะ", "โละจูด", "แม่ดง", "เอราวัณ"],
        "สุคิริน": ["มาโมง", "สุคิริน", "เกียร์", "ภูเขาทอง", "ร่มไทร"],
        "สุไหงโก-ลก": ["สุไหงโก-ลก", "ปาเสมัส", "มูโนะ", "ปูโยะ"],
        "สุไหงปาดี": ["ปะลุรู", "สุไหงปาดี", "โต๊ะเด็ง", "หริ่ง", "กาวะ", "ริโก๋"],
        "จะแนะ": ["จะแนะ", "ดุซงญอ", "ผดุงมาตร", "ช้างเผือก"],
        "เจาะไอร้อง": ["จวบ", "บูกิต", "มะรือโบออก"]
    }
};
